## Loc, ILoc, Ix

In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv("http://bit.ly/imdbratings")

In [3]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [4]:
movies.loc[2, 'star_rating']

9.1

In [5]:
movies.loc[2, :]

star_rating                                                     9.1
title                                        The Godfather: Part II
content_rating                                                    R
genre                                                         Crime
duration                                                        200
actors_list       [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
Name: 2, dtype: object

In [6]:
movies.loc[0:3, 'title':'genre'] # with loc, 0:3 is inclusive of 3

                      title content_rating   genre
0  The Shawshank Redemption              R   Crime
1             The Godfather              R   Crime
2    The Godfather: Part II              R   Crime
3           The Dark Knight          PG-13  Action

In [9]:
movies.loc[:, ['genre', 'star_rating']].head()

    genre  star_rating
0   Crime          9.3
1   Crime          9.2
2   Crime          9.1
3  Action          9.0
4   Crime          8.9

In [7]:
movies.iloc[0:3, [1,3]] # iloc -> Integer location, 0:3 is exclusive of 3

                      title  genre
0  The Shawshank Redemption  Crime
1             The Godfather  Crime
2    The Godfather: Part II  Crime

### Duplicated rows

In [15]:
users = pd.read_csv("http://bit.ly/movieusers", sep='|', header=None, names=['id', 'age', 'sex', 'role', 'zip'], index_col='id')

In [4]:
users.shape

(942, 1)

In [16]:
users.head()

    age sex        role    zip
id
1    24   M  technician  85711
2    53   F       other  94043
3    23   M      writer  32067
4    24   M  technician  43537
5    33   F       other  15213

In [17]:
users.zip.duplicated().sum()

148

In [19]:
users.duplicated().sum()

7

In [22]:
# show duplicate rows
users.loc[users.duplicated(), :]

     age sex      role    zip
id
496   21   F   student  55414
572   51   M  educator  20003
621   17   M   student  60402
684   28   M   student  55414
733   44   F     other  60630
805   27   F     other  20009
890   32   M   student  97301

In [28]:
users.loc[users.duplicated(keep=False), :] # keep='first','last',False

     age sex      role    zip
id
67    17   M   student  60402
85    51   M  educator  20003
198   21   F   student  55414
350   32   M   student  97301
428   28   M   student  55414
437   27   F     other  20009
460   44   F     other  60630
496   21   F   student  55414
572   51   M  educator  20003
621   17   M   student  60402
684   28   M   student  55414
733   44   F     other  60630
805   27   F     other  20009
890   32   M   student  97301

In [26]:
# remove duplicate rows
users.loc[~users.duplicated(), : ].shape

(936, 4)

In [30]:
# better way to remove duplicates
users.drop_duplicates(keep='first').shape

(936, 4)

In [31]:
# identify duplicates using subset columns
users.duplicated(subset=['age','zip'])

id
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
30     False
       ...
914    False
915    False
916    False
917    False
918    False
919    False
920    False
921    False
922    False
923    False
924    False
925    False
926    False
927    False
928    False
929    False
930    False
931    False
932    False
933    False
934    False
935    False
936    False
937    False
938    False
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool